Magazinchik/src/Documents/ПоступлениеТовара/ПоступлениеТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТовара</name>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Magazinchik/src/Documents/ПоступлениеТовара/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "Изменилось количество";

	РассчитатьСуммуСтроки(ТекущиеДанные, Текст);



КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Текст = "Изменилась цена";

	РассчитатьСуммуСтроки(ТекущиеДанные, Текст);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаКлиенте
Процедура РассчитатьСуммуСтроки(Строка, ТекстСообщения)
	
	Строка.Сумма = Строка.Количество * Строка.Цена;
	
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = ТекстСообщения;
	Сообщение.Сообщить();
	
	Сотрудник = ОписаниеЧеловека();
	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = Сотрудник.Имя;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаКлиенте

Функция ОписаниеЧеловека()
	
	Человек = Новый Структура;
	Человек.Вставить("Имя", "Евгений");
	Человек.Вставить("Возраст", 36);
	Человек.Вставить("ВШтате", Истина);
	// Не является ошибкой. На клиенте вызов ТекущаяДата() допустим
	Человек.Вставить("ДатаПриемаНаРаботу", ТекущаяДата());
	
	Возврат Человек;
	
КонецФункции
#КонецОбласти
